package com.example.myapplication.Activity;

import android.content.Intent;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuItem;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ListView;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;

import com.example.myapplication.Adapter.Adapter_2;
import com.example.myapplication.R;

public class List_Item_Activity extends AppCompatActivity {

    ListView listview;
    int i;

    int imagearr[] = {R.drawable.shubh, R.drawable.dosti, R.drawable.majedar, R.drawable.bhagvan, R.drawable.prerna, R.drawable.jivan,
            R.drawable.mohabbat, R.drawable.yaade, R.drawable.anya, R.drawable.rajniti, R.drawable.prem, R.drawable.dard,
            R.drawable.sharab, R.drawable.bewafa, R.drawable.janamdin, R.drawable.holi};
    String shubh[] = {"मत मुस्कुराओ इतना की फूलो को खबर लग जाये,हम करें आपकी तारीफ और आपको नजर लग जाये ,खुदा करे बहुत लम्बी हो आपकी जिंदगी ,और उस पर भी हमारी उम्र लग जाये…",
            "बीते साल को विदा इस तरह करते है,जो नहीं किया अब तक वो भी कर गुजरते है,नया साल आने के खुशिया तो सब मानते है,एक बार हम इते साल कि जस्न मानते है",
            "ये रात चाँदनी बनकर आँगन में आये, ये तारे लोरी गा कर आपको सुनाएं,आयें आपको इतने प्यारे सपने यार...कि नींद में भी आप हलके से मुस्कुराएं।",
            "ईश्वर न करे आपको कोई ग़म हो,और सिर्फ खुशियाँ और हँसी मिले, ग़म जब भी बढ़ चले आपकी ओर, ईश्वर करे रास्ते में उसे पहले हम मिले।",
            "हर पल मे खुशी देती है मा,अपनी ज़िंदगी से जीवन देती है मा, भगवान क्या है!!! मा की पूजा करो जनाब,क्यूकी भगवान को भी जनम देती है मा…",
            "बरसात आये तो ज़मीन गीली न हो,धूप आये तो सरसों पीली न हो,ए दोस्त तूने यह कैसे सोच लिया कि,तेरी याद आये और पलकें गीली न हों।",
            "जा SMS जा मेरे sweetheart के पास,धीरे से जाना शोर न मचाना,busy हो तो चुप रहनाfree हो तो आई मिस यू कहना ..",
            "हम वो नहीं जो दिल तोड़ देंगे,थाम कर हाथ साथ छोड़ देंगे,हम दोस्ती करते हैं पानी और मछली की तरह,जुदा करना चाहे कोई तो हम दम तोड़ देंगे …",
            "दिल से निकली हे दुआ हमारी,जिन्दगी में मिले आपको खुशिया,गम न दे खुदा आपको कभी,चाहे तो एक ख़ुशी कम कर ले हमारी",
            "लोग कहते हैं किसी एक के चले जाने से जिन्दगी अधूरी नहीं होती,लेकिन लाखों के मिल जाने से उस एक की कमी पूरी नहीं होती है"};


    String dosti[] = {"दोस्ती यकीन पर टिकी होती है यह दीवार बड़ी मुश्किल से खड़ी होती है कभी फुर्सत मिले तो पढ़ना रिश्तों की किताब को , दोस्ती खून के रिश्तों से बड़ी होती है ।",
            "दोस्ती हमेशा पागलों से ही करनी चाहिए दोस्त, क्योंकि मुसीबत में कोई समझदार काम नहीं आता ।",
            "बेशक थोड़ा इंतजार मिला हमको, पर दुनिया का सबसे हसीं यार मिला हमको, न रही तमन्ना अब किसी जन्नत की, तेरी दोस्ती में वो मिला हमको ।",
            "कभी झगड़ा, कभी मस्ती, कभी हंसी छोटा सा पल , छोटी - छोटी खुशी एक प्यार की कश्ती और ढेर सारी मस्ती , बस इसी का नाम तो है दोस्ती ।",
            "हमारी दोस्ती हमेशा याद आएगी, हर पल चेहरे पर हंसी और साथ में मस्ती होगी भूलना भी चाहोगे तो कैसे भुलाओगे हमारी दोस्ती को, हमारी दोस्ती तो तुमको उम्र भर याद आएगी।",
            "किनारो पे सागर के ख़ज़ाने नहीं आते, जीवन में दोस्त कभी पुराने नहीं आते, जी लो इन पलों को हंस के मेरे दोस्त क्योंकि फिर लौट के दोस्ती के ज़माने नहीं आते ।",
            "दोस्ती नाम है सुख दुख की कहानी का, दोस्ती राज़ है सदा मुस्कुराने का, पल भर की नहीं है ये दोस्ती,  दोस्ती तो यारा वादा है उमर भर साथ निभाने का ।",
            "आँखों की बेनूरी अच्छी नहीं होती, दोस्तो की दूरी अच्छी नहीं होती, कभी कभी मिल भी लिया करो यार हर समय sms से मस्ती पूरी नहीं होती ।",
            "दोस्ती से कीमती कोई जागीर नहीं होती … दोस्ती से खूबसूरत कोई तस्वीर नहीं होती …. दोस्ती तो वो धागा है जिससे मजबूत कोई जंजीर नहीं होती ! ",
            "दोस्ती वह डोर है जो अजनबियों को जोड़ देती है , हर पग पर ज़िन्दगी को एक नया मोड़ देती है , सच्चा दोस्त हमेशा तब साथ देता है , जब सारी दुनिया साथ छोड़ देती है !!"};


    String majedar[] = {"🤣😂🥴🤪😜,ज़िन्दगी में सदा मुस्कराते रहो,फासले कम करो दिल से दिल मिलाते रहो, र्द कैसा भी हो कोई ग़म न करो, आयोडेक्स खरीदो और लगाते रहो। \uD83E\uDD23\uD83D\uDE02\uD83E\uDD74\uD83E\uDD2A\uD83D\uDE1C",
            "पहले में अपने जान कोहररोज याद किया करता था,जितना भी कमाता था ,उसके पीछे बरर्बद किया करता था|",
            "मत ढूँढ़ो मुझे दुनिया \uD83C\uDF0E की तन्हाई में, ठंड ⛄ बहुत है,मैं यही हूँ अपनी रज़ाई \uD83D\uDDFB में।",
            "हम तनहा ही चले थे \uD83E\uDD23\uD83D\uDE02\uD83E\uDD74\uD83E\uDD2A\uD83D\uDE1C दोस्ती बुरी हो तो होने उसे मत दो,अगर हो गयी तो उसे खोने मत दो,और अगर दोस्त हो सबसे प्यारा तो,उसे चैन की नींद सोने मत दो।,\uD83E\uDD23\uD83D\uDE02\uD83E\uDD74\uD83E\uDD2A\uD83D\uDE1C",
            "अर्ज किया है… ना इश्क करो झूठा, ना प्यार करो फर्जी, ना इश्क़ करो झूठा, ना प्यार करो फर्जी, आगे नही बताऊंगा, मेरी शायरी मेरी मर्जी",
            "मोहब्बत कर ली तुमसे बहुत सोचने के बाद, अब किसी को देखना नहीं तुम्हें देखने के बाद,दुनिया छोड़ देंगे तुम्हें पाने के बाद,खुदा माफ करे इतना झूठ बोलने के बाद !",
            "आज कुछ शर्माए से लगते हो,सर्दी के कारण कंपकंपाये से लगते हो,चेहरा आपका खिल उठा है,लगता है हफ़्तों के बाद नहाये लगते हो !",
            "यारो मेरे मरने के बाद आँसू मत बहाना,ज्यादा याद आए तो उपर ही चले आना !",
            "किसी से दिल लगाने से अच्छा है,घर में झाडू पोछा लगा लो,कम से कम मम्मी तो खुश हो जाएँगी !",
            "पता नही लोग प्रपोज कैसे कर देते हैं,मुझे तो समोसे के साथ चटनी,मांगने में भी शरम आती है !"};

    String bhagavan[] = {"ईश्वर पर आप तभी विश्वास कर सकते हैं,जब आपको खुद पर विश्वास हो क्योकिईश्वर बाहर नही हमारे अंदर ही हैं!!",
            "मैं “किसी से” बेहतर करुं क्या फर्क पड़ता है..!मै “किसी का” बेहतर करूं बहुत फर्क पड़ता है..!!",
            "जब ईश्वर मनुष्य की परीक्षा लेते हैं,तब वो मनुष्य का सामर्थ्य भी बढ़ा देते हैं,ताकि वो अधिक बुद्धिमान और अधिक ताकतवर बनें!!",
            "भगवान बोलते है…तू करता वही है, जो तू चाहता है!पर होता वही है जो मैं चाहता हूँ,तू वही कर जो मैं चाहता हूँ,फिर होगा वही जो तू चाहता है…!",
            "शायद मेरे पास सब कुछ नहींपर ईश्वर ने मुझे वो सब दिया है,जिसकी मुझे जरुरत है।मैं इसके लिए ईश्वर का आभारी हूँ।",
            "हे मालिक! मेरी गुमराहियों,मेरे दोष देखकर उन्हें अनदेखा कर देना,क्यूंकि मैं जिस माहौल में रहता हूँ उसका नाम दुनिया है..!!",
            "सच्चा प्रेम और भगवान एक जैसे ही होते हैंजिसके बारें में बातें सब करते हैंलेकिन महसूस बहुत कम ही लोग करते हैं!!",
            "मेरे जिस्म जान में भोलेनाथ नाम तुम्हारा है,आज अगर मैं खुश हूँ तो यह एहसान भी तुम्हारा है,थामा हुआ है हाथ मेरा आपने मुझको मालूम है,मेरे हर पल हर लम्हे में मेरे भोलेनाथ प्यार तुम्हारा है!",
            "वो तैराक भी डूब जाते हैं जिनको ख़ुद पर गुमान होता हैंऔर वो गँवार भी डूबते-डूबते पार हो जाते हैं,जिन पर भगवान मेहरबान होते हैं!",
            "ईश्वर से कुछ मागने पर न मिले तो नाराज न होना।क्योकि, ईश्वर वह नहीं देता जो आपको अच्छा लगता है,बल्कि वह देता जो आपके लिए अच्छा होता है!!"};

    String prerna[] = {"जब टूटने लगे होसले तो बस ये याद रखना,िना मेहनत के हासिल तख्तो ताज नहीं होते,ढूंड लेना अंधेरों में मंजिल अपनी,जुगनू कभी रौशनी के मोहताज नहीं होते.",
            "खुशबू बनकर गुलों से उड़ा करते हैं,ुआं बनकर पर्वतों से उड़ा करते हैं,ये कैंचियाँ खाक हमें उड़ने से रोकेगी,हम परों से नहीं हौसलों से उड़ा करते हैं.",
            "जिन्दगी में कई मुश्किलें आती है,और इन्सान जिन्दा रहने से घबराता हैं,ना जाने कैसे हजारो कांटो के बीच,रह कर एक फूल मुस्कुराता है.",
            "गम ना कर, जिंदगी बहुत बड़ी है,चाहत की महफ़िल तेरे लिए सजी है,बस एक बार मुस्कुरा कर तो देख,तकदीर खुद तुझसे मिलने बाहर खड़ी है….",
            "फूल बनकर मुस्कुराना जिंदगी,मुस्कुराके गम भूलना जिंदगी,जीत कर कोई खुश हो तो क्या हुआ,हार कर खुशिया मनाना भी जिंदगी.",
            "हर रिश्ते में विश्वास रहने दो,जुबान पर हर वक्त मिठास रहने दो,यही तो अंदाज है जिंदगी जीने का ,न खुद रहो उदास, न दूसरों को रहने दो….!",
            "कितनो की तकदीर बदलनी है तुम्हेितनो को रास्ते पे लाना है तुम्हे,अपने हाथ की लकीरो को मत देखो, इन लकीरो से आगे जाना है तुम्हे",
            "सामने हो मंजिल तो रास्ते ना मोड़ना,जो भी मन में हो वो सपना ना तोडना,कदम – कदम पर मिलेगी मुशकिल आपको,बस सितारे चुन – ने के लिए कभी जमीन को मत छोड़ना.",
            "बुझी शमा भी जल सकती है,तूफान से कश्ती भी निकल सकती है,हो के मायूस ना यू,अपने इरादे बदल,तेरी किस्मत कभी भी बदल सकती है.",
            "कितनी आसान थी जिन्दगी तेरी राहें,मुश्किलें हम खुद ही खरीदते है,और कुछ मिल जाये तो अच्छा होता,बहुत पा लेने पर भी यही सोचते है."};

    String jivan[] = {"कभी-कभी हँसी आती हैं मुझे,कैसे इतनी मुस्कान बिखेर जाती हूँ,दिल हर पल रोता हैं,फिर भी कैसे छिपा जाती हूँ,भीड़ में भी तन्हा हैं मेरी जिन्दगी,बस आसुंओं से हैं मेरी सच्ची बन्दगी",
            "जिंदगी में प्यार सभी को होता हैं,हर किसी के दिल में कोई शख्स बैठा होता हैं,नसीब वाले होते हैं वो लोग,जिनके जीवन में साथ उनका होता हैं",
            "हर गलती की सजा देती हैं जिन्दगी,लेकिन साथ रहकर सहती भी हैं जिन्दगी,ख़ुशी हो या गम अपनाती हैं जिन्दगी,हर पल साथ निभाती हैं ज़िन्दगी",
            "शान-ए-जिन्दगी वही,जब कोई तुमसे से दुखी नहीं,खुद भी हँसो और दुसरो को हंसाओ,इसी ताल में जिन्दगी जी जाओ",
            "जीवन का सच कड़वा हैं,यहाँ कोई पल नहीं ठहरा हैं,आज जिव की रफ़्तार तेज हो गई,भगा दौड़ी में जिन्दगी कहीं खो गई हैं",
            "आज हम है तेरे साथ,कम हमारी यादे होंगी तेरे पास,कभी पन्ने पलट लेना उन यादों के,वादा हैं तुझे बरस उठेंगे हम तेरी आँखों से",
            "जीवन की राहो में हम साथ तेरा ढूंढते हैं,तेरे ख्यालो में हम अक्सर ही खो जाते हैं,कैसे जियेंगे इस जीवन में तेरे बिन,हम तो बिना तेरे साँस भी ना ले पाते हैं",
            "उदास रातों को जब नींद नहीं आती,बीती जिन्दगी पलकों पर दस्तक दे जाती,आंसू की धार के साथ वो कहानी सुनाती हैं,बीते लम्हों को फिर आज वो आँखों में सजा जाती है",
            "जब जीना ही हैं जिन्दगी को,तो क्यूँ पल-पल आँसू बहाये,एक बार हँसकर गले तो लगाओ गम को,ये गम आने से ही शरमाये",
            "पल पल बदलता हैं जिन्दगी का नजाराखाली पन्नो में जुड़ता जाता हैं जिन्दगी का फसना,कभी पलट कर देखना उन पन्नो कोजहाँ था साथ मेरा तुम्हारा"};

    String mohabbat[] = {"मोहब्बत तो की थी हमने लेकिन,यह सोच कर भुला दिया कि,अभी घर की जिम्मेदारी बहुत है !",
            "तेरी खूबसूरती के लिए मैं क्या कहूँभरी दोपहर में भी चमकता चाँद हो तुम !",
            "सब कुछ खोकर भी सिर्फ,तुझे पाने की चाहत करता हूँ मैं,जरा सोच तुझसे कितनी मोहब्बत करता हूँ में !",
            "मैं खुद हैरान हूँ तुमसे इतनी मोहब्बत क्यों है,मुझे जब भी प्यार शब्द आता है,चेहरा तुम्हारा ही याद आता है !",
            "मोहब्बत भी अजीब चीज बनायीं खुदा तूने,तेरे ही मंदिर में तेरे ही बंदे,तेरे ही सामने रोते हैं,तुझे नहीं किसी और को पाने के लिए !",
            "सच्ची मोहब्बत की एक ही निशानी हैचाहे कितना भी लड़ लें झगड़ लें,फिर भी एक दूसरे के बगैर रह ना पाए !",
            "मोहब्बत की आजमाइश दे दे कर थक गया हूँ ऐ खुदा,किस्मत मेँ कोई ऐसा लिख दे जो मौत तक वफा करे !",
            "मोहब्बत की हवा जिस्म की दवा बन गयी,दूरी आपकी मेरी चाहत की सजा बन गयी,कैसे भूलूँ आपको एक पल के लिए,आपकी याद हमारे जीने की वजह बन गयी !",
            "दुनिया चाहे हमें मिलने का मौका दे या ना दे,अगर हमारी मोहब्बत सच्ची है तो,कुदरत भी हमारी मोहब्बत के सामने झुक जाएगी !",
            "मोहब्बत मे कभी कोई जबरदस्ती नही होती,जब तुम्हारा जी चाहे तुम बस मेरे हो जाना !"};

    String yaade[] = {"कभी कभी किसी अपने की इतनी, याद आती है की रोने के लिए ,रात भी कम पड़ जाती है !!",
            "न जाने क्यों जिंदगी काँटे की तरह चुभ रही है , तेरी हर एक बात अब,बहुत याद आ रही है !! ",
            "दिल की हालात किसी से कही नही जाती ,हमसे उनकी चाहत छुपाई नही जाती ,बस एक याद बची है ,उनके चले जाने के बाद ,वो भी दिल से ,टायी नही जाती !!",
            "उम्र के राह में रास्ते बदल जाते है ,वक्त की आंधी में इंसान बदल जाते है ,सोचते है तुम्हें इतना याद ना करे, लेकिन आँख बंद करते ही इरादे बदल जाते है !!",
            "दूर रहते है मगर दिल से दुआ करते है हम , प्यार का फ़र्ज़ अदा करते है हम , आपकी याद सदा साथ रखते है हम , दिन हो या रात आपको ही याद करते है हम !!",
            "अब तो तुम्हारी यादें भी आँखों तक आती है , बस थोड़ी देर ठहरती है , फ़िर बूंदे बन के गिर जाती है !!",
            "दुनिया की कभी ना परवाह करना दिल से ना कभी हमें जुदा करना , जब आए तुम्हें याद हमारी तो बस मिलने की दुआ करना !!!",
            "यादें भी क्या क्या करा देती है ,कोई शायर हो गया तो कोई खामोश !!",
            "मत पूछो की मैं अल्फाज़ कहा से लता हूँ ,ये उसकी यादों का खज़ाना है ,बस लुटाए जा रहा हूँ !!",
            "हिचकियों को मत भेजो अपना मुखबिर बना के हमें और भी काम है तुम्हें याद करने के सिवा  !!"};

    String anya[] = {"खुद पर भरोसा करने का हुनर सीख लो, सहारे कितने भी सच्चे हो एक दिन साथ छोड़ ही जाते है।",
            "शीशा कमज़ोर बहुत होता है, लेकिन सच दिखाने से घबराता नहीं।",
            "अपने हौंसले को यह मत बताओ कि तुम्हारी तकलीफ कितनी बड़ी है, अपनी तकलीफ को यह बताओ कि तुम्हारा हौंसला कितना बड़ा है।",
            "जिन्दगी की राहों में अंधेरा बहुत है,ये कभी मत कहना राहों को रौशन करना है अगर, तो दिल में सदा उम्मीद की लौ जलाये रखना।",
            "नाकामयाबी की धुंध से न घबराना, तेरी कामयाबी का सूरज तेरी तकदीर रौशन कर जायेगा।",
            "कर्म करो तो फल मिलता है, आज नहीं तो कल मिलता है, जितना गहरा अधिक हो कुआँ, उतना मीठा जल मिलता है।",
            "मंजिल पे जिन्हें जाना है,तूफानों से डरा नहीं करते, तूफानों से जो डरे, मंजिल कभी पाया नहीं करते।",
            "धूप हो या छाव हो, काली रात हो या बरसात हो, मैं हर वक्त चलता रहता हूँ, इसलिए मैं जीत जाता हूँ।",
            "परिंदे रुक मत तुझमे जान बाकी है, मंजिल दूर है, बहुत उड़ान बाकी है।",
            "उनके लिए सवेरे नहीं होते, जो जिंदगी में कुछ भी पाने की उम्मीद छोड़ चुके है, उजाला तो उनका होता है,जो बार बार हारने के बाद कुछ पाने की उम्मीद रखे है।"};

    String rajniti[] = {"सरकार को गरीबों का ख्याल कब आता है?,चुनाव नजदीक आ जाए तो मुद्दा उछाला जाता है.",
            "चोर, बेईमान और भ्रष्ट नेताओं की क्यों करते हो बात,लोकतंत्र की ताकत है जनता में, दिखला दो इनकी औकात.",
            "जहाँ सच हैं, वहाँ पर हम खड़े हैं,इसी खातिर आँखों में गड़े हैं.",
            "नेता की बातों में सच्चाई का अभाव होता है,झूठ बोलना तो इनका स्वभाव होता हैं.",
            "नेता भी क्या खूब ठगते हैं,ये तो 5 साल बाद ही दिखते हैं.",
            "नजर वाले को हिन्दू और मुसलमान दिखता हैं,मैं अन्धा हूँ साहब, मुझे तो हर शख्स में इंसान दिखता हैं.",
            "लोकतंत्र जब अपने असली रंग में आता हैं,तो नेताओं की औकात का पता चल जाता हैं.",
            "तुम से पहले वो जो इक शख़्स यहाँ तख़्त-नशीं था,उस को भी अपने ख़ुदा होने पे इतना ही यक़ीं था.",
            "गंदी राजनीति का यह भी एक परिणाम हैं,बीस रूपये एक बोतल पानी का दाम हैं.",
            "सवाल जहर का नहीं था, वो तो मैं पी गया,तकलीफ लोगों को तब हुई, जब मैं फिर भी जी गया."};

    String prem[] = {"होती नहीं है मोहब्बत सूरत से,मोहब्बत तो दिल से होती है,सूरत उनकी खुद-ब-खुद लगती है प्यारी,कदर जिनकी दिल में होती है",
            "सब ने चाहा कि उसे हम ना मिलें,हम ने चाहा उसे गम ना मिलें,अगर ख़ुशी मिलती है उसे हम से जुदा होकर,तो दुआ है ख़ुदा से कि उसे कभी हम ना मिलें",
            "लोग तो मरते हैं हुस्न पर,मेरा दिल तो तेरी गुफ्तगू पर मरता है",
            "लम्हे कुछ पुराणी लिख दूँ,कुछ नटखटी तो कुछ शैतानी लिख दूँ,इजाजत दे के देखिये,आप दोनों पे एक कहानी लिख दूँ",
            "शिकवा करने गए थे, और,इबादत सी हो गयी।,तुझे भूलने की जिद्द थी,मगर तेरी आदत सी हो गयी",
            "गम में ख़ुशी की वजह बनी है मोहब्बत,दर्द में यादों की वजह बनी है मोहब्बत,जब कुछ भी ना रहा था अच्छा इस दुनिया में,तब हमारे जीने की वजह बनी है यह मोहब्बत",
            "नजाकत ले के आँखों में,वो उनका देखना तौबा,या खुदा हम उन्हें देखें,कि उनका देखना देखें",
            "तमन्ना है मेरे मन की हर पल साथ तुम्हारा हो,तने भी सांसे चले हैं हर सांस पर नाम तुम्हारा हो",
            "सुना है लोग जहाँ खोएं वहीँ मिलते हैं,मैं अपने आपको तुझमे तलाश करता हूँ",
            "खींच लेती है, मुझे उसकी ? मोहब्बत।,वरना हम बहुत बार मिले है, आखरी बार उनसे"};

    String dard[] = {"तुझे पाने की तमन्ना दिल से निकाल दी मैंने,मगर आँखों को तेरे इंतज़ार की आदत सी बन गयी है !",
            "हाल तो पूछती नहीं दुनिया जिंदा लोगों का,चले आते हैं लोग जनाजे पर बारात की तरह !!",
            "मिलता भी नहीं तुम्हारे जैसे इस शहर में,हमको क्या मालूम था के तुम भी किसी और के हो !",
            "तकदीर के आईने में मेरी तस्वीर खो गई,आज हमेशा के लिए मेरी रूह सो गई,मोहब्बत करके क्या पाया मैंने,वो कल मेरी थी आज किसी और की हो गई !!",
            "ज़िंदगी रही तो याद सिर्फ,तुम्हे ही करते रहेंगे,भूल गए तो समझ जाना,अब हम ज़िंदा नही रहे।।",
            "सफेद लिबास उसे बहुत पसंद था मगर,आज जो हम कफन में लिपटे हैं,तो वो रोता क्यों है !!",
            "कभी सोचा न था के वो मुझे तनहा कर जायेगा,जो अक्सर परेशां देख कर कहता था मैं हूँ ना !!",
            "कौन कहता है नफरतों मैं दर्द होता है,कुछ मोहब्बत बड़ी कमाल की होती है !!",
            "हमें नही आता अपने दर्द का दिखावा करना,बस अकेले रोते हैं और सो जाते हैं !!",
            "महफ़िल में गले मिलके वो धीरे से कह गए,ये दुनिया की रस्म है !!,इसे मोहब्बत न समझलेना !!"};

    String sharab[] = {"तेरे जाने के बाद जीने की ख्वाइश ना थी,कमबख्त शराब ने हमें मरने से बचा लिया.,",
            "तेरे साथ बिताए लम्हों को याद कर मुस्कराता हैं,जीने की कोई वजह नहीं फिर भी जीना चाहता हैं,जिस दिन हो जाए दिल बहुत ज्यादा उदास,इसे शराब के नशे में बहका कर खुश हो जाता हैं.,",
            "जब आती है तेरी याद तो,बीती बातें याद कर फिर से जी लेता हु मैं,जब संभाल नहीं पता इस दिल को,तो महखाने में जाकर शराब पी लेता हु मै.,",
            "एक बार टूट जाए दिल तो,फिर  ना किसी से मोहब्बत दुबारा होती है,जब आए उस बेवफा की याद तो,फिर जीने का शराब ही सहारा होती है.,",
            "पीता हूं जितनी उतनी ही तेरी याद आती है,साकी ने जैसे इश्क़ मिला दिया हो तेरा शराब में.,",
            "रहता हूँ बहका बहका तो शराबी ना समझना,कभी किसी की यादें भी बहका दिया करती हैं.,",
            "बारिश में आग लगाना चाहता है,वो शराब पीला कर मुझे आज़माना चाहता है.,",
            "माना तेरे पास हुस्न है लेकिन,मेरे दिल के साथ ऐसे मत खेल,रे हाथों में शराब है,िसके आगे तेरा हुस्न है फेल.,",
            "हमारा दिल टूटा है हम को चाय मत पिलाओ,अगर दर्द मिटाना चाहते हो मेरा तो,पानी में मिलाकर शराब लेकर आओ.,",
            "एक वक्त था जब तेरी आँखों से पी कर जीते थे,लाख बुरे थे लेकिन शराब कभी नहीं पीते थे.,"};

    String bewafa[] = {"हम इश्क़ में वफ़ा करते करते बेहाल हो गए,और वो बेवफाई करके भी खुशहाल हो गए।",
            "जब आपको बिना गलती के सजा मिले,तो उसे Bewafai कहा जाता है।",
            "मोहब्बत में ऐसा क्यों होता है,बेवफाई में वो रोते हैं और वफ़ा में हम रोए हैं।",
            "सब कुछ होते हुए भी इस दिल का दर्द नहीं जाता,क्यूंकि किस्मत ने हमें Bewafai बना दिया।",
            "दुनिया वालों का भी अजीब दस्तूर है बेवफाई मेहबूब से मिलती है ,और बेवफा मोहब्बत बन जाती है।",
            "जिससे हमने Bewafai पायी,वो हमसे वफ़ा की उम्मीद करते हैं,िल पर जख़्म देके, निशान शरीर पर ढूंढ़ते हैं।",
            "मुझे बेवफाई नहीं चाइये थी,मुझे धोका नहीं चाइये था,मुझे तो बस थोड़ा सा प्यार चाइये था!!",
            "अभी पास है तो ठोकर मारकर bewafa बना देते हो,जब दूर हो जाएंगे, तो प्यार जाताओगे!",
            "एक दौर था वो हर वक़्त मेरी फ़िक्र करने वाली ,हर समय मेरे बारे मैं सोचने वाली कहाँ चली गई,वफ़ा करने वाली, bewafai करके चली गयी !",
            "हमने ये सोचा वो वापिस आए हमारी मोहब्बत के लिए,मगर वो बेवफा वापिस आए सिर्फ अपने काम के लिए!"};

    String janamdin[] = {"आज का ख़ास दिन मुबारक हो आपको,प्यारे-प्यारे ख्वाब मुबारक हो आपको,जिन्दगी के साथ जो आई है खुशियां खूब सारी,वो खुशियों की बहार मुबारक हो आपको।जन्मदिन की शुभकामनाएं।",
            "दीपक में अगर नूर ना होता,तन्हा दिल इतना मजबूर ना होता,हम आपको खुद बर्थडे विश करने आते,अगर आपका आशियाना इतनी दूर ना होता।",
            "जन्मदिन के ये ख़ास लम्हें मुबारक,आँखों में बसे नए ख्वाब मुबारक,जिंदगी जो लेकर आई है आपके लिए आज,वो तमाम खुशियों की हंसीं सौगात मुबारक।",
            "आपके जन्मदिन पर हम देते हैं ये दुआ,खुशियाँ आपके दामन से कभी न हों जुदा,खुदा की रहमतों में कभी कमी न आये,आपके होंठों की ये मुस्कराहट न जाए।",
            "दुनिया की खुशियाँ आपको मिल जायें,अपनों से मिलके आपका मन खिल जाये,चेहरे पर दुःख की कभी शिकन भी न हो,आपके जन्मदिन पर मेरी दिल से शुभकामनाएं।",
            "तमाम उम्र तुम्हे ज़िन्दगी का प्यार मिले,खुदा करे ये ख़ुशी तुमको बार बार मिले,तुम्हे जन्मदिन की ढेर सारी शुभकामनाएं।",
            "तुम्हारे जन्मदिन पर ये दुआ है हमारी,जितने हों चाँद तारे उतनी उम्र तुम्हारी।,जन्मदिन मुबारक हो।",
            "फूलों सा महकता रहे हमेशा जीवन तुम्हारा,खुशिया चूमे कदम तुम्हरे,बहुत सारा प्यार और आशीर्वाद हमारा।,जन्मदिन मुबारक हो।",
            "मुस्कान आपके होंठों से कहीं जाए नहीं,आंसू आपके पलकों पे कभी आये नहीं,पूरा हो आपका हर ख्वाब,और जो पूरा ना हो वो ख्वाब कभी आये नहीं।",
            "जन्मदिन के ये ख़ास लम्हें मुबारक,आँखों में बसे नए ख्वाब मुबारक,जिंदगी जो लेकर आई है आपके लिए आज,वो तमाम खुशियों की हंसीं सौगात मुबारक।,जन्मदिन की शुभकामनाएं।"};

    String holi[] = {"गुलाल का रंग, गुब्बारों की मार,सूरज की किरणे,खुशियों की बहार,चांद की चांदनी, अपनों का प्यार,मुबारक हो आपको रंगों का त्यौहार",
            "हवाओं के साथ अरमान भेजा है,नेटवर्क के जरिये पैगाम भेजा है,वो हम हैं, जिसने सबसे पहले,होली का राम-राम भेजा है। शुभ होली। ",
            "जो पूरी सर्दी नहीं नहाये,हो रही उनको नहलाने की तैयारी,बाहर नहीं तुम आये तो,घर में आकर मारेंगे पिचकारी",
            "आज मुबारक, कल मुबारक,होली का हर पल मुबारक,रंग बिरंगी होली में,हमारा भी एक रंग मुबारक।,हैप्पी होली 2023",
            "कदम-कदम पर खुशियां रहें,गम से कभी ना हो सामना,जिंदगी  में हर पल खुशियां नसीब हों,मेरी तरफ से होली की शुभकामना।",
            "पूर्णिमा का चांद रंगों की डोली,चांद से उसकी चांदनी बोली,खुशियों से भर दे सबकी झोली,आपके जीवन को रंग दे ये होली,होली की शुभकामनाएं।।",
            "रंगों से भी रंगीन जिंदगी है हमारी,रंगीली रहे यह बंदगी हमारी,कभी न बिगड़े या प्यार की रंगोली,ऐ मेरे यार 'हैप्पी होली'",
            "हमेशा मीठी रहे आपकी बोली,खुशियों से भर जाए आपकी झोली,आप सबको मेरी तरह से हैप्पी होली",
            "खा के गुजिया,पी के भंग,लगा के थोड़ा थोड़ा सा रंग,बजा के ढोलक और मृदंग,खेलें होली हम तेरे संग",
            "राधा का रंग और कान्हा की पिचकारी ,प्यार के रंग से रंग दो दुनिया सारी ,ये रंग न जाने कोई जात न कोई बोली,मुबारक हो आपको रंगों भरी होली।"};


    Adapter_2 adapter;
    String x[];
    private int img;
    Toolbar toolbar;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_list_item);

        listview = findViewById(R.id.listview2);
        toolbar = findViewById(R.id.toolBar);

        setSupportActionBar(toolbar);

        i = getIntent().getIntExtra("pos", 0);
        img = getIntent().getIntExtra("img", 0);

        if (i == 0) {
            x = shubh;
        } else if (i == 1) {
            x = dosti;
        } else if (i == 2) {
            x = majedar;
        } else if (i == 3) {
            x = bhagavan;
        } else if (i == 4) {
            x = prerna;
        } else if (i == 5) {
            x = jivan;
        } else if (i == 6) {
            x = mohabbat;
        } else if (i == 7) {
            x = yaade;
        } else if (i == 8) {
            x = anya;
        } else if (i == 9) {
            x = rajniti;
        } else if (i == 10) {
            x = prem;
        } else if (i == 11) {
            x = dard;
        } else if (i == 12) {
            x = sharab;
        } else if (i == 13) {
            x = bewafa;
        } else if (i == 14) {
            x = janamdin;
        } else if (i == 15) {
            x = holi;
        }

        adapter = new Adapter_2(List_Item_Activity.this, img, i, x);
        listview.setAdapter(adapter);

        listview.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> adapterView, View view, int i, long l) {
                Intent intent = new Intent(List_Item_Activity.this, Details_Activity.class);
                intent.putExtra("i", i);
                intent.putExtra("total", x.length);
                intent.putExtra("x", x);
                startActivity(intent);
            }
        });
    }

    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        getMenuInflater().inflate(R.menu.option_menu, menu);
        return super.onCreateOptionsMenu(menu);
    }

    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        if (item.getItemId() == R.id.menu_Share) {
            Intent shareIntent = new Intent(Intent.ACTION_SEND);
            shareIntent.setType("text/plain");
            shareIntent.putExtra(Intent.EXTRA_SUBJECT, "My application name");
            String shareMessage = "\nHi I have downloaded Hindi Love Shayari app \n" +
                    "It is a best app for read and share shayari.\n" +
                    "You should also try\n\n";
            shareMessage = shareMessage + "https://play.google.com/store/apps/details?id=com.loveshayarisn";
            shareIntent.putExtra(Intent.EXTRA_TEXT, shareMessage);
            startActivity(Intent.createChooser(shareIntent, "choose one"));
        }
        if (item.getItemId() == R.id.share) {
            Intent shareIntent = new Intent(Intent.ACTION_SEND);
            shareIntent.setType("text/plain");
            shareIntent.putExtra(Intent.EXTRA_SUBJECT, "My application name");
            String shareMessage = "\nHi I have downloaded Hindi Love Shayari app \n" +
                    "It is a best app for read and share shayari.\n" +
                    "You should also try\n\n";
            shareMessage = shareMessage + "https://play.google.com/store/apps/details?id=com.loveshayarisn";
            shareIntent.putExtra(Intent.EXTRA_TEXT, shareMessage);
            startActivity(Intent.createChooser(shareIntent, "choose one"));
        }

        return super.onOptionsItemSelected(item);
    }
}